Repository: romeroyakovlev/rebol1
Catalog: rebol1-level1.tmx
Source language: en_us
Languages: ru_ru

source: Lists, Tables, and the "Foreach" Function 2.1 Managing Spreadsheet-Like Data 2.2 Some Simple List Algorithms (Count, Sum, Average, Max/Min) 2.3 Searching 2.4 Gathering Data, and the "Copy" Function 2.5 List Comparison Functions 2.6 Creating Lists From User Input 2.7 Three Useful Data Storage Programs: Inventory, Contacts, Schedule 2.8 Working With Tables of Data: Columns and Rows 2.9 Additional List/Block/Series Functions and Techniques 2.10 Sorting Lists and Tables of Data 2.11 CSV Files and the "Parse" Function 2.12 Two Paypal Report Programs, Analyzed 2.13 Some Perspective about Studying These Topics 3\.
ru_ru: Списки, таблицы и функция "Foreach" 2.1 Управление табличными данными 2.2 Несколько простых алгоритмов списка (Count, Sum, Average, Max/Min) 2.3 Поиск 2.4 Сбор данных и функция "Copy" 2.5 Функции сравнения списков 2.6 Создание списков из пользовательского ввода 2.7 Три полезные программы для хранения данных: Inventory, Contacts, Schedule 2.8 Работа с таблицами: Столбцы и строки 2.9 Дополнительные функции и техники для List/Block/Series 2.10 Сортировка списков и таблиц 2.11 CSV файлы и функция "Parse" 2.12 Анализ двух программ отчётов Paypal 2.13 Некоторые перспективы изучения этих тем 3\.

source: # Creating Business Applications With REBOL
ru_ru: # Создание бизнес-приложений с REBOL

source: The previous introduction to this text has been removed.
ru_ru: Предыдущее введение к этому тексту было удалено.

source: Also, be sure to see the short examples at http://re-bol.com/short_rebol_examples.r for a fast and interesting overview of Rebol's simple/productive coding style.
ru_ru: Также не забудьте посмотреть короткие примеры на http://re-bol.com/short_rebol_examples.r для быстрого и интересного обзора простого/продуктивного стиля кодирования на Rebol.

source: ** It's recommended that you first read http://re-bol.com/rebol_quick_start.html and try the app builder at http://withoutwritingcode.com for a quick introduction to Rebol coding.
ru_ru: ** Рекомендуется сначала прочесть http://re-bol.com/rebol_quick_start.html и попробовать конструктор приложений http://withoutwritingcode.com для быстрого ознакомления с программированием на Rebol.

source: It's available here and in a shorter version here A slideshow presentation covering the previous introduction is available here.
ru_ru: Оно доступно здесь и краткая версия здесь. Презентация, охватывающая предыдущее введение доступна здесь.

source: A Crash Course Introduction to REBOL 1.1 Installing and Running Programs 1.2 Opening REBOL Directly to the Console 1.3 Some Short Code Examples to Whet Your Appetite 1.4 Basics of REBOL Coding 1.5 Conditional Evaluations 1.6 Some More Useful Functions 2\.
ru_ru: Ускоренный курс введения в REBOL 1.1 Установка и запуск программ 1.2 Открытие REBOL прямо в консоли 1.3 Несколько кратких примеров кода для разжигания аппетита 1.4 Основы кодирования на REBOL 1.5 Условные оценки 1.6 Ещё больше полезных функций 2\.

source: Go to http://rebolforum.com to ask questions.
ru_ru: На форуме http://rebolforum.com можно задавать вопросы.

source: Then return to read this text for a more complete look at all of Rebol's capabilities.
ru_ru: Затем вернитесь к чтению этого текста для более полного взгляда на все возможности Rebol.

source: > ** By: Nick Antonaccio Updated: 12-16-2015 Learn to solve common business data management problems with a versatile development tool that's simple enough for "non-programmers".
ru_ru: > ** By: Nick Antonaccio Обновлено: 12-16-2015 Научитесь решать типовые проблемы управления бизнес-данными с помощью гибкого инструмента разработки, достаточно простого для непрограммистов.

source: Quick Review and Clarification 5\.
ru_ru: Краткий обзор и прояснение 5\.

source: See also 68 YouTube video tutorials about REBOL (10 hours of video).
ru_ru: Также посмотрите 68 видео на YouTube с видеоуроками REBOL (10 часов видео).

source: See http://re-bol.com/examples.txt for many more Rebol code examples.
ru_ru: Смотрите http://re-bol.com/examples.txt где много других примеров кода на Rebol.

source: ## Contents:
ru_ru: ## Содержание:
